

card_reflect = {
    "Anan1":['上清道符',[],[],[]],
    'Anan2':['百合灵水',[],[],[]],
    'Anan3':['新科学捉鬼专家',[],[],[]],
    'Apple1':['彩色的白',[],[],[]],
    'Apple2':['等量的光',[],[],[]],
    'Apple3':['一些微小的工作',[],[],[]],
    'Eternity1':['活力手袋',[],[],[]],
    'Eternity2':['古董贝扇',[],[],[]],
    'Eternity3':['埃克塞特的奇闻',[],[],[]],
    'Bkornblume1':['小心袖口',[],[],[]],
    'Bkornblume2':['注意墙外',[],[],[]],
    'Bkornblume3':['不请自来的点评者',[],[],[]],
    "MedicinePocket1":['固有习性',[],[],[]],
    'MedicinePocket2':['炼金容器',[],[],[]],
    'MedicinePocket3':['二十六项次生反应',[],[],[]],
    'Knight1':['公义',[],[],[]],
    'Knight2':['荣耀',[],[],[]],
    'Knight3':['公元七七八年后',[],[],[]],
    'Voyager1':['群星奏鸣',[],[],[]],
    'Voyager2':['弥合协奏',[],[],[]],
    'Voyager3':['琴弦上的星系',[],[],[]],
    'NewBabel1':['旧观念',[],[],[]],
    'NewBabel2':['新浪潮',[],[],[]],
    'NewBabel3':['未来，近在咫尺',[],[],[]],
    'Sotheby1':['三倍用量！',[140,2,"attack"],[210,2,"attack"],[350,2,"attack"]],
    'Sotheby2':['浓缩精华！',[50,3,'health',2],[75,3,"health",2],[125,3,"health",2]],
    'Sotheby3':['把他们统统混合！',[350,3,"finally"],[],[]],
    'Druvis1':['风入林',[],[],[]],
    'Druvis2':['露渐白',[],[],[]],
    'Druvis3':['林间，静默将至',[],[],[]],
    'Lilya1':['侧风起飞',[160,1,'attack'],[240,1,'attack'],[400,1,'attack']],
    'Lilya2':['钟型摆动',[150,2,'attack'],[225,2,'attack'],[375,2,'attack']],
    'Lilya3':['一点小花招',[700,1,'finally'],[],[]],
    'Regulus1':['洗洗耳朵',[],[],[]],
    'Regulus2':['晒晒眼睛',[],[],[]],
    'Regulus3':['狂欢与不眠夜',[],[],[]],
    'Centurion1':["全胜将军",[180,1,'attack'],[270,1,'attack'],[560,1,'attack']],
    'Centurion2':["户外明星",[150,2,'attack'],[150,2,'attack'],[225,2,'attack']],
    'Centurion3':["真人秀火热开场",[300,3,'finally'],[],[]],
    'Sonetto1':["戒律·其五",[200,1,'attack'],[200,1,'debuff'],[300,1,'debuff']],
    'Sonetto2':["劝勉·其九",[15,3,'buff'],[20,2,'buff'],[25,3,'buff']],
    'Sonetto3':["规章之外的咏叹诗",[300,3,'finally'],[],[]],
    'Charlie1':["赐你雷电！",[],[],[]],
    'Charlie2':["予你风暴！",[],[],[]],
    'Charlie3':["我独立于剧场之上",[],[],[]],
    'BalloonParty1':["皮纳塔塔",[],[],[]],
    'BalloonParty2':["咳咳怪人",[],[],[]],
    'BalloonParty3':["好孩子、坏大人",[],[],[]],
    'Matilda1':["天才习作",[],[],[]],
    'Matilda2':["众望瞩目",[],[],[]],
    'Matilda3':["一瞬间的预示",[],[],[]],
    'Voyager1':['群星奏鸣',[150,2,'attack'],[150,2,'debuff',1],[200,2,'debuff',2]],
    'Voyager2':['弥合协奏',[100,3,'counter'],[100,4,'counter'],[100,5,'counter']],
    'Voyager3':['琴弦上的星系',[500,1,'finally'],[],[]],
    'None':"无卡牌",

}
name_to_english= {
    '温妮弗雷德' : 'Eternity',
    '兔毛手袋' : 'MedicinePocket',
    '新巴别塔' : 'NewBabel',
    '泥鯭的士' : 'Anan',
    '新巴别塔' : 'NewBabel',
    '苏芙比' : 'Sotheby',
    '槲寄生' : 'Druvis',
    '远旅' : 'Voyager',
    '未锈铠' : 'Knight',
    '红弩箭' : 'Lilya',
    '星锑' : 'Regulus',
    '百夫长' : 'Centurion',
    '十四行诗' : 'Sonetto',
    '夏利' : 'Charlie',
    '气球派对' : 'BalloonParty',
    '玛蒂尔达' : 'Matilda',

}
stack_buff = ['弥合协奏',]
buff=['百合灵水',"劝勉·其九",]
debuff=['注意墙外']
limit_aoe=['埃克塞特的奇闻',"好孩子、坏大人",'新科学捉鬼专家','公元七七八年后','把他们统统混合！','未来，近在咫尺','林间，静默将至','狂欢与不眠夜',"真人秀火热开场","规章之外的咏叹诗","我独立于剧场之上",'一些微小的工作']
limit_one=['不请自来的点评者','二十六项次生反应','琴弦上的星系','一点小花招',"一瞬间的预示",]
dps_aoe = ['古董贝扇','荣耀','露渐白','晒晒眼睛']
aoe=['群星奏鸣','三倍用量！','钟型摆动',"户外明星","众望瞩目",]
heal = ['炼金容器','浓缩精华！','新浪潮',"咳咳怪人",'等量的光']
dps_attack = ['小心袖口','活力手袋','上清道符','公义','侧风起飞','洗洗耳朵',"全胜将军"]
attack=["天才习作",'固有习性','旧观念','风入林',"戒律·其五","赐你雷电！","予你风暴！","皮纳塔塔",'彩色的白']
